In [1]:
import pandas as pd

In [6]:
df = pd.DataFrame({'a':[1,2,1],'b':[1,1,1]})

In [7]:
df['a']==1

0     True
1    False
2     True
Name: a, dtype: bool

In [8]:
df['a'].unique()

array([1, 2])

In [9]:
df[df['a']<2]

   a  b
0  1  1
2  1  1

In [10]:
import requests
import pandas as pd

filename = "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/LxjSAttmoxJfEG6il1Bqfw/Product-sales.csv"

def download(url, filename):
    response = requests.get(url)
    print(response.status_code,response.reason)
    if response.status_code == 200:
        with open(filename, "wb") as f:
            f.write(response.content)
            

download(filename, "Product-sales.csv")

404 Not Found

In [11]:
%pip install xlrd openpyxl

Collecting xlrd
  Downloading xlrd-2.0.2-py2.py3-none-any.whl.metadata (3.5 kB)
Collecting openpyxl
  Downloading openpyxl-3.1.5-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-2.0.0-py3-none-any.whl.metadata (2.7 kB)
Downloading xlrd-2.0.2-py2.py3-none-any.whl (96 kB)
Downloading openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
Downloading et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: xlrd, et-xmlfile, openpyxl

   -------------------------- ------------- 2/3 [openpyxl]
   -------------------------- ------------- 2/3 [openpyxl]
   -------------------------- ------------- 2/3 [openpyxl]
   ---------------------------------------- 3/3 [openpyxl]

Successfully installed et-xmlfile-2.0.0 openpyxl-3.1.5 xlrd-2.0.2
Note: you may need to restart the kernel to use updated packages.

In [ ]:
from pyodide_http import pyfetch
import pandas as pd

filename = "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/LxjSAttmoxJfEG6il1Bqfw/Product-sales.csv"

async def download(url, filename):
    response = await pyfetch(url)
    if response.status == 200:
        with open(filename,"wb") as f:
            f.write(await response.bytes())

await download(filename, "Product-sales.csv")

df = pd.read_csv("Product-sales.csv")

ImportError: cannot import name 'pyfetch' from 'pyodide_http' (C:\Users\pmoha\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.11_qbz5n2kfra8p0\LocalCache\local-packages\Python311\site-packages\pyodide_http\__init__.py)

In [15]:
import requests
import pandas as pd
from io import StringIO

url = "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/n9LouKI9SlUa1b5zkaCMeg/Product-sales.xlsx"

# Fetch the CSV file
response = requests.get(url)

# Check if successful
if response.status_code == 200:
    # Directly read into pandas
    df = pd.read_csv(StringIO(response.text))
    print(df.head())
else:
    print("Failed to download file:", response.status_code)

Failed to download file: 404

In [16]:


data = {
    "OrderID":[1,2,3,4,5],
    "Product":['Laptop','Smartphone','Desk Chair','Notebook','Monitor'],
    "Quantity":[2,3,5,10,1],
    "Price":[800,600,150,2,300],
    "Total":[1600,1800,750,20,300],
    "OrderDate":pd.to_datetime(['2023-01-15','2023-01-17','2023-01-20','2023-01-22','2023-01-25'],),
    "CustomerCity":['New York','Los Angeles','Chicago','Houston','Miami']
}

df = pd.DataFrame(data)

df

   OrderID     Product  Quantity  Price  Total  OrderDate CustomerCity
0        1      Laptop         2    800   1600 2023-01-15     New York
1        2  Smartphone         3    600   1800 2023-01-17  Los Angeles
2        3  Desk Chair         5    150    750 2023-01-20      Chicago
3        4    Notebook        10      2     20 2023-01-22      Houston
4        5     Monitor         1    300    300 2023-01-25        Miami

In [18]:
x = df[['Quantity']]
x

   Quantity
0         2
1         3
2         5
3        10
4         1

In [19]:
x = df[['Product']]
x

      Product
0      Laptop
1  Smartphone
2  Desk Chair
3    Notebook
4     Monitor

In [20]:
type(x)

pandas.core.frame.DataFrame

In [22]:
y = df[['Product','Price','Quantity']]
y

      Product  Price  Quantity
0      Laptop    800         2
1  Smartphone    600         3
2  Desk Chair    150         5
3    Notebook      2        10
4     Monitor    300         1

In [ ]:
# Access the value in the first row and first column
df.iloc[0,0]

np.int64(1)

In [24]:
# Access the value in the second row and first column
df.iloc[1,0]

np.int64(2)

In [25]:
# Access the value in the first row and third column
df.iloc[0,2]

np.int64(2)

In [28]:
# Access the value in the second row and third column
df.iloc[1,2]

np.int64(3)

In [29]:

df.loc[0, 'Product']  # Access the value in the first row and 'Product' column

'Laptop'

In [31]:
df.loc[1, 'Product']  # Access the value in the second row and 'Product' column

'Smartphone'

In [32]:
df.loc[1,'CustomerCity'] # Access the value in the second row and 'CustomerCity' column

'Los Angeles'

In [33]:
df.iloc[0:2, 0:3]  # Access the first two rows and first three columns by slicing

   OrderID     Product  Quantity
0        1      Laptop         2
1        2  Smartphone         3

In [34]:
df.loc[0:2, ['Product', 'Price', 'Quantity']]  # Access the first two rows and specific columns by labels using slicing

      Product  Price  Quantity
0      Laptop    800         2
1  Smartphone    600         3
2  Desk Chair    150         5

In [35]:
new_index = ['a', 'b', 'c', 'd', 'e']
df_new = df
df_new.index = new_index
df_new.loc['a','CustomerCity'] # Access the value in the first row and 'CustomerCity' column using new index

'New York'

In [36]:
df_new

   OrderID     Product  Quantity  Price  Total  OrderDate CustomerCity
a        1      Laptop         2    800   1600 2023-01-15     New York
b        2  Smartphone         3    600   1800 2023-01-17  Los Angeles
c        3  Desk Chair         5    150    750 2023-01-20      Chicago
d        4    Notebook        10      2     20 2023-01-22      Houston
e        5     Monitor         1    300    300 2023-01-25        Miami

In [37]:
df_new.loc['a':'d','CustomerCity'] # Access rows 'a' to 'd' and 'CustomerCity' column using new index

a       New York
b    Los Angeles
c        Chicago
d        Houston
Name: CustomerCity, dtype: object